//1.Вычислить n-ое треугольного число(сумма чисел от 1 до n), n! (произведение чисел от 1 до n)

import java.util.Scanner;
//     public class program{
//         public static void main(String[] args) {
//             Scanner iScanner = new Scanner(System.in);
//             //System.out.printf("n: ");
//             Integer n = iScanner.nextInt();
//             // System.out.printf("Привет. %s!", name);
//             // iScanner.close();
//             method(n);
//             method2(n); 
//         }   
        
//         private static void method(int x) {
//             int i = 1;
//             int sum = 0;
//             while (i <= x){
//                 sum+=i;
//                 i+=1;   
//             }
//             System.out.println(sum);
//         }   
//         private static void method2(int y) {
//             int i = 1;
//             int fact = 1;
//             while (i <= y){
//                 fact*=i;
//                 i+=1;   
//             }
//             System.out.println(fact);
//         }   

//     }
//2.Написать метод, принимающий на вход два целых числа и проверяющий, что их сумма лежит в пределах от 10 до 20 (включительно),
// если да – вернуть true, в противном случае – false.

// public class program{
//     public static void main(String[] args) {
//         Scanner iScanner = new Scanner(System.in);
//         Integer n = iScanner.nextInt();
//         Integer m = iScanner.nextInt();

//         method(n,m);  
//     }  
        
//     private static void method(int x, int y) {
//         int sum = x+y;
//         if (sum<=20 && sum >= 10){
//             System.out.println(true);
//         }
//         else{
//             System.out.println(false);
//         }   
//     }   
// }    
// 3.Написать метод, которому в качестве параметра передается целое число, метод должен напечатать в консоль, 
// положительное ли число передали или отрицательное. Замечание: ноль считаем положительным числом.

// public class program{
//     public static void main(String[] args) {
//         Scanner iScanner = new Scanner(System.in);
//         Integer n = iScanner.nextInt();
            

//         method(n);  
//     } 
//     private static void method(int x) {
//         if (x>=0){
//             System.out.println("число положительное"); 
//          }   
//         else{
//              System.out.println("число отрицательное");
//         }                     
//     }      
// }

